app/controllers/products_controller.rb

  def index
    @items_per_row = 3
    if params[:q]
      search_term = params[:q] # return our filtered list here
      products_to_show = Product.search(search_term)
      # if(Rails.cache.read('product_#{search_term}'))
      #   @product_count = Rails.cache.read('product_#{search_term}')
      # else
      #   @product_count = products_to_show.count
      #   Rails.cache.write('product_#{search_term}', @product_count)
      # end
    else
      products_to_show = Product.all
      # if(Rails.cache.read('products'))
      #   @product_count = Rails.cache.read('products')
      # else
      #   @product_count = products_to_show.count
      #   Rails.cache.write('products', @product_count)
      # end
    end
    @products = products_to_show.paginate(:page => params[:page], :per_page => 9)
---
SELECT "products".* FROM "products"
SELECT  "products".* FROM "products" LIMIT ?  [["LIMIT", 3]]

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "description", "image_url", "created_at", "updated_at", "colour") VALUES (?, ?, ?, ?, ?, ?)  [["name", "wrewtrw"], ["description", "erer"], ["image_url", ""], ["created_at", "2017-12-07 13:57:21.932663"], ["updated_at", "2017-12-07 13:57:21.932663"], ["colour", ""]]

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "description" = ?, "image_url" = ?, "colour" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["description", "Glitter"], ["image_url", "nailpaint.jpg"], ["colour", "Golden"], ["updated_at", "2017-11-30 16:30:50.546369"], ["id", 10]]